parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
/**
 * @file main.cpp
 * @author Parth Pate; (parth.pmech@gmail.com)
 * @brief 
 * @version 0.1
 * @date 2021-11-23
 * @copyright Copyright (c) 2021
 */

//! Include Header Files
#include <Arduino.h>
#include <iostream>
#include <string>
#include "PIN_CONNECTION.h"
#include "USER_CONFIGURATION.h"
#include "DEVICE_CONFIGURATION.h"

//! WiFi and NTP Setup
//Reference (NTP Setup): https://lastminuteengineers.com/esp32-ntp-server-date-time-tutorial/
#include <WiFi.h>
#include "time.h"
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include "HTML_FILE.h"
AsyncWebServer server(80);
char ssid[10];
char password[20];
const char *ntpServer = "asia.pool.ntp.org";
const long gmtOffset_sec = 19800; // +5:30 = (5*60*60) + (30*60) = 19800
const int daylightOffset_sec = 0; // India doesn't observe DayLight Saving
uint16_t year;
uint8_t month;
uint8_t date;
uint8_t hour;
uint8_t minutes;
uint8_t seconds;

//! RTC DS3231 Setup
//Reference (RTC DS3231): https://how2electronics.com/esp32-ds3231-based-real-time-clock/
//Reference (RTCLib Library): //https://adafruit.github.io/RTClib/html/index.html/
#include <SPI.h>
#include <Wire.h>
#include "RTClib.h"
RTC_DS3231 rtc;

//! OLED Setup
//Reference (OLED): https://randomnerdtutorials.com/esp32-ssd1306-oled-display-arduino-ide/
//Reference (Display LOGO on OLED): Reference: https://create.arduino.cc/projecthub/Arnov_Sharma_makes/displaying-your-own-photo-on-oled-display-5a8e8b
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include "COMPANY_LOGO.c"
#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
#define OLED_RESET -1    // Reset pin # (or -1 if sharing reset pin)
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

//! Menu Setup
// Code for Main Screen List
int lastMillis;
int main_screen_count = 1;
String latest_error_log = "";
#define CHARACTER_LENGTH 9 // Maximum Character Length allowed in a line on OLED

// Code for Menu List
#define MAIN_MENU_LIST 6
#define SUB_MENU_LEVEL 2
#define SUB_MENU_LIST 5
#define OLED_MENU_TEXT_SIZE 2
String main_menu[MAIN_MENU_LIST][SUB_MENU_LEVEL][SUB_MENU_LIST] = {
    {{"< Back"}, {}},
    {{"Connected\n Boxes"}, {"< Back"}},
    {{"Connect\n New WiFi"}, {"< Back"}},
    {{"Reciever\n Details"}, {"< Back"}},
    {{"Error Log"}, {"< Back"}},
    {{"Contact\n Us"}, {"< Back"}},
};

//! NRF24 Setup
//Reference (NRF24): https://howtomechatronics.com/tutorials/arduino/arduino-wireless-communication-nrf24l01-tutorial/
#include <nRF24L01.h>
#include <RF24.h>
RF24 radio(NRF24_CE, NRF24_CSN);
const int AVAILABLE_CHARACTERS = 62;
char alphabet[AVAILABLE_CHARACTERS] = {
    'A', 'B', 'C', 'D', 'E', 'F', 'G',
    'H', 'I', 'J', 'K', 'L', 'M', 'N',
    'O', 'P', 'Q', 'R', 'S', 'T', 'U',
    'V', 'W', 'X', 'Y', 'Z', 'a', 'b',
    'c', 'd', 'e', 'f', 'g', 'h', 'i',
    'j', 'k', 'l', 'm', 'n', 'o', 'p',
    'q', 'r', 's', 't', 'u', 'v', 'w',
    'x', 'y', 'z', '1', '2', '3', '4',
    '5', '6', '7', '8', '9', '0'};
char BROADCAST_RECIEVER_ADDRESS[5] = {'b', 'o', 'x', 'i', 't'};
String BOX_DETAILS[MAX_BOXES][3];

//! SD Card Setup
//Reference (SD Card Module): https://randomnerdtutorials.com/esp32-microsd-card-arduino/
//Reference: (ReadLines Library): https://github.com/mykeels/ReadLines/blob/master/examples/print-line-and-index/print-line-only.ino
#include "FS.h"
#include "SD.h"
#include <ReadLines.h>
const char AWS_BACKLOG_FILE[] = "/AWS_Backlog_file.txt";
const char NRF_COMMUNICATION_ADDRESS_FILE[] = "/NRF_Communication_file.txt";
char BOX_ID_DETAILS_FILE[] = "/Box_ID_Details.txt";
char ERROR_LOG_FILE[] = "/Error_Log.txt";
char SSID_FILE[] = "/SSID.txt";
char PASSWORD_FILE[] = "/Password.txt";
char file_extension[] = ".txt";
char line1[RL_MAX_CHARS];

//! Encoder Setup
//Reference (Encoder): https://howtomechatronics.com/tutorials/arduino/rotary-encoder-works-use-arduino/
#define outputA RE_DT
#define outputB RE_CLK
#define outputS RE_SW
#define DEBOUNCE_TIME 50
float counter = 0;
int aState;
int aLastState;

//! WS2812 Neopixel Ring
//Reference (WS2812 NeoPixel LED Ring): https://create.arduino.cc/projecthub/robocircuits/neopixel-tutorial-1ccfb9
#include <Adafruit_NeoPixel.h>
#define NUMPIXELS 8 //Number of LEDs on NeoPixel
Adafruit_NeoPixel pixels(NUMPIXELS, RGB_D1, NEO_GRB + NEO_KHZ800);
#define RED_COLOR pixels.Color(255, 0, 0)
#define GREEN_COLOR pixels.Color(0, 255, 0)
#define BLUE_COLOR pixels.Color(0, 0, 255)
#define YELLOW_COLOR pixels.Color(255, 255, 0)

//! AWS Setup
#include <WiFiClientSecure.h>
#include <MQTT.h>
#include <ArduinoJson.h>
WiFiClientSecure net;
MQTTClient client;

//! Setting Up Timers
/**
* Reference (Timer Alarm): https://diyprojects.io/esp32-timers-alarms-interrupts-arduino-code/#.YZjLhaJBzDe
*@brief 
*Timer of 5 mins needs to be made
*That is 5 * 60 sec = 300 sec.
*Prescalar possible : 
* -2 ^ 8 = 256 = 4 mins 16 secs -> We are choosing this option as this is closest to the required timer
* -2 ^ 9 = 512 = 8 mins 32 secs *
*/
#define DELAY_ONE_MINUTES 1 * 60     // 1 min periodic count
#define DELAY_FIVE_MINUTES 5 * 60    // 5 mins periodic count
#define DELAY_TEN_MINUTES 10 * 60    // 10 mins periodic count
#define DELAY_THIRTY_MINUTES 30 * 60 // 30 mins periodic count
#define DELAY_SIXTY_MINUTES 60 * 60  // 60 mins periodic count
#define ESP32_CLOCK 80000000         // 80MHz Clock on ESP32
#define PRESCALAR 80                 // Prescalar creates a timer to set the alarm for 4 min 16 sec
hw_timer_t *timer = NULL;
/**
 * @brief The count variable increments everytime the timer overflows,
 * When count > timer delay, the polling of boxes is done.
 */
volatile int count;

//! Setting up EEPROM
/**
 * @brief We are using EEPROM to store the number of boxes connected with the reciever
 * Reference (EEPROM): https://randomnerdtutorials.com/esp32-flash-memory/
 */
#include <EEPROM.h>
#define EEPROM_SIZE 1
#define CONNECTED_BOXES_STORED_LOCATION 0

//! Function Definition
void configure_timer(void);
void IRAM_ATTR onTime(void);
void pin_setup(void);
void wifi_ntp_setup(void);
void rtc_setup(void);
void oled_setup(void);
void sd_setup(void);
void rgb_ring_setup(void);
void aws_setup(void);
void print_company_logo(void);
void update_oled(String text1, String text2, String text3);
void oled_menu_update(String item1, String item2, String item3);
void printLocalTime(void);
void rtc_get_time(void);
void solid_rgb_ring(uint32_t color);
void halt_rgb_ring(int led_number);
void listDir(fs::FS &fs, const char *dirname, uint8_t levels);
void createDir(fs::FS &fs, const char *path);
void deleteFile(fs::FS &fs, const char *path);
void readFile(fs::FS &fs, const char *path);
void writeFile(fs::FS &fs, const char *path, const char *message);
void appendFile(fs::FS &fs, const char *path, const char *message);
void read_rotary_encoder(void);
void add_new_box(String box_id, String dt);
void calibrate_box(String box_id, String box_address);
void update_box_data(String box_id, String box_address);
void change_box_setting(String box_id, String box_address, String dt, String st, String bt);
void sound_buzzer(String box_id, String box_address);
void write_radio(char transmission_address[], String transmission_message);
String read_radio(char recieving_address[]);
void regular_box_update(int counter);
String fetch_box_address(String box_id);
void read_box_details_from_sd_card(void);
void handleEachLine(char line[], int lineIndex);
void handleEachErrorLine(char line[], int lineIndex);
void handleEachSSIDLine(char line[], int lineIndex);
void handleEachPasswordLine(char line[], int lineIndex);
void messageReceived(String &topic, String &payload);
void lwMQTTErr(lwmqtt_err_t reason);
void lwMQTTErrConnection(lwmqtt_return_code_t reason);
void connectToMqtt(bool nonBlocking);
void connectToWiFi(String init_str);
void checkWiFiThenMQTT(void);
void checkWiFiThenMQTTNonBlocking(void);
void checkWiFiThenReboot(void);
void send_Success_Data(String box_id, String command, int success_status, String param1, String param2, String param3);
void sendData(String box_id, String message);
void connect_to_new_wifi(void);

//! Function Declaration

