parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
//TODO: Timer Functions
/**
 * @brief Configuring Timer for Alarm.
 */
void configure_timer(void)
{
    Serial.println("Configuring Timers");
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Setting", "Up", "Timer");

    timer = timerBegin(0, PRESCALAR, true);
    timerAttachInterrupt(timer, &onTime, true);
    timerAlarmWrite(timer, (ESP32_CLOCK / PRESCALAR), true);

    solid_rgb_ring(GREEN_COLOR);
    update_oled("Timer", "Setup", "Done");
    return;
}

/**
 * @brief This Funtion is activated when the timer overflows. Each time the timer overflows,
 * the count variable increments.
 */
void IRAM_ATTR onTime(void)
{
    count++;
    return;
}

//TODO: Basic Setup for the code
/**
 * @brief Setting up the pins INPUT/OUTPUT
 */
void pin_setup(void)
{
    pinMode(outputA, INPUT);
    pinMode(outputB, INPUT);
    pinMode(outputS, INPUT);
    return;
}

/**
 * @brief Setup WiFi and NTP
 */
void wifi_ntp_setup(void)
{
    //connect to WiFi
    Serial.println("Setting up WiFi and NTP");
    solid_rgb_ring(YELLOW_COLOR);

    RL.readLines(SSID_FILE, &handleEachSSIDLine);
    RL.readLines(PASSWORD_FILE, &handleEachPasswordLine);
    Serial.println("STR SSID: " + (String)ssid);
    Serial.println("STR Password: " + (String)password);

    if ((String)ssid == "")
        connect_to_new_wifi();

    update_oled("Wifi", "Connecting", ssid);
    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, password);

    while (WiFi.status() != WL_CONNECTED)
    {
        delay(50);
        Serial.print(".");
    }
    Serial.println("CONNECTED");

    solid_rgb_ring(GREEN_COLOR);
    update_oled("Wifi is", "Connected", ssid);

    // Configure NTP
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
    rtc_setup();
    printLocalTime();
    return;
}

/**
 * @brief Setup RTC
 */
void rtc_setup(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("RTC", "Connection", "In Progress");
    Serial.println("Setting up RTC");

    if (!rtc.begin())
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("RTC", "Connection", "Failed");
        Serial.println("Couldn't find RTC");
    }

    Serial.println("RTC Setup Done");
    solid_rgb_ring(GREEN_COLOR);
    update_oled("RTC", "Setup", "Done");
    return;
}

/**
 * @brief Setting Up OLED Module
 */
void oled_setup(void)
{
    Serial.println("Setting up OLED");
    if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3C))
        Serial.println("SSD1306 allocation failed");

    display.clearDisplay();

    print_company_logo();
    delay(500);
    solid_rgb_ring(RED_COLOR);
    delay(500);
    solid_rgb_ring(YELLOW_COLOR);
    delay(500);
    solid_rgb_ring(GREEN_COLOR);
    delay(500);
    return;
}

/**
 * @brief Setup SD Card
 * 
 */
void sd_setup(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Setting", "up", "MicroSD");
    Serial.println("Setting up SD Card");
    if (!SD.begin(SD_CS))
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("MicroSD", "Mount", "Failed");
        Serial.println("Card Mount Failed");
        return;
    }
    solid_rgb_ring(GREEN_COLOR);
    update_oled("MicroSD", "Setup", "Done");
    return;
}

/**
 * @brief Setting up the NeoPixels LED Ring
 */
void rgb_ring_setup(void)
{
    Serial.println("Setting up RGB Ring");
    pixels.begin();
    pixels.setBrightness(LED_BRIGHTNESS * 255 / 100);
    return;
}

/**
 * @brief Setup AWS
 * 
 */
void aws_setup(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("AWS", "Setup", "In Progress");
    Serial.println("Setting up AWS");
    net.setCACert(cacert);
    net.setCertificate(client_cert);
    net.setPrivateKey(privkey);
    client.begin(MQTT_HOST, MQTT_PORT, net);
    client.onMessage(messageReceived);
    connectToMqtt(false);
    solid_rgb_ring(GREEN_COLOR);
    update_oled("AWS", "Setup", "Complete");
}

//TODO: OLED Functions

/**
 * @brief Print Company Logo on OLED and turn the switch LED Ring to BLUE Color
 */
void print_company_logo(void)
{
    Serial.println("Printing Company Logo");

    display.clearDisplay();
    display.drawBitmap(0, 0, COMPANY_LOGO, SCREEN_WIDTH, SCREEN_HEIGHT, WHITE);
    display.display();

    solid_rgb_ring(BLUE_COLOR);
    return;
}

/**
 * @brief Display String on OLED
 * 
 * @param text1 Text on Line 1
 * @param text2 Text on Line 2
 * @param text3 Text on Line 3
 */
void update_oled(String text1, String text2, String text3)
{
    Serial.println("Updating OLED to:\n" + text1 + '\t' + text2 + '\t' + text3);

    display.clearDisplay();
    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setTextColor(WHITE);

    display.setCursor(0, 0);
    display.println(text1);

    display.setCursor(0, SCREEN_HEIGHT / 3);
    display.println(text2);

    display.setCursor(0, 2 * SCREEN_HEIGHT / 3);
    display.println(text3);

    display.display();
    return;
}

/**
 * @brief Display Menu Items on the OLED
 * 
 * @param item1 Menu Item 1 on Line 1
 * @param item2 Menu Item 2 on Line 2
 * @param item3 Menu Item 3 on Line 3
 */
void oled_menu_update(String item1, String item2, String item3)
{
    display.clearDisplay();

    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setTextColor(WHITE);

    display.setCursor(0, 0);
    display.println("-");

    display.setCursor(15, 0);
    display.println(item1);
    if (item1.length() <= CHARACTER_LENGTH)
    {
        display.setCursor(15, SCREEN_HEIGHT / 3);
        display.println(item2);
        if (item2.length() <= CHARACTER_LENGTH)
        {
            display.setCursor(15, 2 * SCREEN_HEIGHT / 3);
            display.println(item3);
        }
    }
    else
    {
        display.setCursor(15, 2 * SCREEN_HEIGHT / 3);
        display.println(item2);
    }

    display.display();

    return;
}

//TODO: WiFi and NTP Functions
/**
 * @brief Tries to get local time from NTP:
 * -> If it's successful, The year, month, date, hour, minutes, seconds is updated to global variables with time from NTP,
 * and the time is saved to RTC.
 * -> If it fails, the fuction is called rtc_get_time()
 */
void printLocalTime(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Updating", "NTP", "");
    Serial.println("Fetching Latest Time from NTP");

    struct tm timeinfo;
    if (!getLocalTime(&timeinfo))
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("NTP", "Update", "Failed");
        Serial.println("NTP Failed to Update");
        rtc_get_time();
        return;
    }

    year = timeinfo.tm_year - 100;
    month = timeinfo.tm_mon + 1;
    date = timeinfo.tm_mday;
    hour = timeinfo.tm_hour;
    minutes = timeinfo.tm_min;
    seconds = timeinfo.tm_sec;

    solid_rgb_ring(GREEN_COLOR);
    update_oled("NTP", "Update", "Success");
    String day = (String)year + '/' + (String)month + '/' + (String)date;
    String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
    Serial.println("Time from NTP:\n" + day + ' ' + time);
    update_oled("NTP Time", day, time);
    delay(1000);

    solid_rgb_ring(YELLOW_COLOR);
    update_oled("RTC", "Update", "In Progress");
    rtc.adjust(DateTime(year, month, date, hour, minutes, seconds));

    solid_rgb_ring(GREEN_COLOR);
    update_oled("RTC", "Update", "Successful");
    return;
}

