parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
//TODO: Rotary Encoder Functions
/**
 * @brief Reads the Rotary Encoder and Update the OLED to interface the menu
 * After selecting the menu item, the respective function is executed.
 * The menu interface works in the below described method:
 * The menu is 2 levelled menu. The main menu and the sub menu.
 * Initially, the main menu is been scrolled through via oled, when the switch is pressed on rotary encoder,
 * the sub menu for the respective primary menu is selected.
 */
void read_rotary_encoder(void)
{
    Serial.println("Enabling Rotary Encoder");

    int main_list_pos = 0;            // Position of the cursor on the main menu
    int sub_list_pos = 0;             // Position of the cursor on the sub list
    int menu_level = 0;               // Level of the cursor on the menu level
    int menu_item = 0;                // The value of the selected menu item
    int menu_length = MAIN_MENU_LIST; // Variable to store the number of items at the current menu level
    aLastState = digitalRead(outputA);

    // 3 items to display on the oled
    String item1 = main_menu[main_list_pos + 0][menu_level][sub_list_pos];
    String item2 = main_menu[main_list_pos + 1][menu_level][sub_list_pos];
    String item3 = main_menu[main_list_pos + 2][menu_level][sub_list_pos];
    oled_menu_update(item1, item2, item3);

    while (1)
    {
        item1 = "";
        item2 = "";
        item3 = "";
        aState = digitalRead(outputA); // Reads the "current" state of the outputA
        if (aState != aLastState)      // If the previous and the current state of the outputA are different, that means a Pulse has occured
        {
            delay(DEBOUNCE_TIME / 3);
            aState = digitalRead(outputA); // Reads the "current" state of the outputA
            if (aState != aLastState)      // If the previous and the current state of the outputA are different, that means a Pulse has occured
            {

                if (digitalRead(outputB) != aState) // If the outputB state is different to the outputA state, that means the encoder is rotating clockwise
                    counter += 0.5;                 // increment of 0.5 is done to ensure that the the complete click of RE is measured as one turn
                else
                    counter -= 0.5; // decrement of 0.5 is done to ensure that the the complete click of RE is measured as one turn

                if ((int)counter >= menu_length - 1)
                    counter = menu_length - 1; // Ensures that the menu list does not go below the coded list to avoid menu display error
                else if ((int)counter < 0)
                    counter = 0; // Ensures that the menu list does not go above the coded list to avoid menu display error
                Serial.println("Counter: " + (String)((int)counter));
            }
        }
        if (digitalRead(outputS) == HIGH)
        {
            delay(3 * DEBOUNCE_TIME);
            if (digitalRead(outputS) == HIGH)
            {
                if ((int)counter == 0)
                {
                    if (menu_level == 0)
                    {
                        break;
                    }
                    else
                    {
                        menu_level--;
                        menu_item = 0;
                    }
                }
                else
                {
                    counter = 0;
                    if (menu_item != 10)
                    {
                        menu_level++;
                        menu_item = 10 * main_list_pos;
                    }
                }
            }
        }
        if (menu_level == 0)
        {
            main_list_pos = (int)counter;
            item1 = main_menu[main_list_pos][menu_level][0];
            if ((int)counter < menu_length - 1)
                item2 = main_menu[main_list_pos + 1][menu_level][0];
            if ((int)counter < menu_length - 2)
                item3 = main_menu[main_list_pos + 2][menu_level][0];
        }
        else if (menu_level == 1)
        {
            item1 = main_menu[main_list_pos][1][0];
            if (menu_item != 10)
            {
                counter = 0;
                switch (menu_item)
                {

                case 20: // Connect to New Wifi
                    connect_to_new_wifi();
                    break;

                case 30: // Reciever Details
                    item2 = "Rec. ID";
                    item3 = RECIEVER_ID;
                    break;

                case 40: // Error Log
                    item2 = "Err. Log";
                    item3 = latest_error_log;
                    break;

                case 50: // Contact us
                    item2 = contact_us_link;
                    break;

                default:
                    break;
                }
            }
            else if (menu_item == 10)
            {
                sub_list_pos = (int)counter;
                if (sub_list_pos == 0)
                {
                    item1 = main_menu[main_list_pos][1][0];
                }
                else
                {
                    item1 = BOX_DETAILS[sub_list_pos][0];
                }
                if ((int)counter < menu_length - 1)
                    item2 = BOX_DETAILS[sub_list_pos + 1][0];
                if ((int)counter < menu_length - 2)
                    item3 = BOX_DETAILS[sub_list_pos + 2][0];
            }
        }
        oled_menu_update(item1, item2, item3);
    }
    solid_rgb_ring(BLUE_COLOR);
    return;
}
//TODO: Menu Operation Functions

//TODO: Special Protocols
/**
 * @brief Protocol to add new box as per AWS's recieved command
 * The box is added as per the process listed below:
 * 1. AWS sends the box ID to be sent
 * 2. A random address is generated for the purpose of communication.
 * 3. Reciever broadcasts a message at the address "boxit" with message "pair,<box_id>,<random_generated_communication_address>"
 * 4. Change the reciever to the address generated for the box.
 * 5. Wait for the reciever to reply with the message "pair,ok,<box_id>"
 * 5.1 If message recieved is not same as mentioned, then connection status flag = 0 and send_success_data(<box_id>,add,connection_status) is called.
 * 5.2 If message recieved is same as mentioned:
 * 5.2.1 EEPROM is called where the total connected box data is available and the data is saved in connected_box variable.
 * 5.2.2 connected_box variable is incremented by one and then saved again to the EEPROM.
 * 5.2.3 The String in format <box_id><communicaiton_address> is saved in the SD Card
 * 5.2.4 Box_ID_Array is updated with the newly added box.
 * 5.2.5 AWS is notified by calling send_success_data(<box_id>,add,connection_status,<communication_address>)
 * 
 * @param box_id
 */
void add_new_box(String box_id, String dt)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Adding", "New Box", box_id);

    // Generate Random Address for Communication
    srand(time(0));
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
        address[i] = alphabet[rand() % (AVAILABLE_CHARACTERS - 1)];

    // Write the message in format "pair,<box_id>,<communication_address>"
    String message = "pair," + box_id + "," + (String)address;
    write_radio(BROADCAST_RECIEVER_ADDRESS, message);

    // Wait for the Box to return a message
    String recieved_message = read_radio(address);
    int connection_status = 0; // 0 -> Failure, 1 -> Success

    // Check if the recieved message is in format "pair,ok,<box_id>"
    if (recieved_message = ("pair,ok," + (String)box_id))
    { // TRUE
        connection_status = 1;

