parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
    String message = "buzz";
    write_radio(address, message);

    solid_rgb_ring(GREEN_COLOR);
    update_oled("Buzz", "Box", "Successful");
}

//TODO: NRF24 Functions
/**
 * @brief Write a message to the NRF Radio
 * 
 * @param transmission_address 5 byte Transmission Address
 * @param transmission_message 32 byte Transmission Message
 */
void write_radio(char transmission_address[], String transmission_message)
{
    update_oled("Sending", "Message", "via NRF");

    byte address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
        address[i] = transmission_address[i];

    radio.openWritingPipe(address);
    radio.setPALevel(RF24_PA_MIN);
    radio.stopListening();
    delay(100);

    radio.write(&transmission_message, sizeof(transmission_message));
    delay(500);
    return;
}

/**
 * @brief Reading the Message from Radio
 * 
 * @param recieving_address 5 byte Recieving Address
 * @return String Recieved Message
 */
String read_radio(char recieving_address[])
{
    update_oled("Recieving", "Message", "via NRF");

    byte address[COMMUNICATION_ID_LENGTH];
    for (size_t i = 0; i < COMMUNICATION_ID_LENGTH; i++)
        address[i] = recieving_address[i];

    radio.openReadingPipe(0, address);
    radio.setPALevel(RF24_PA_MIN);
    radio.startListening();
    delay(100);

    String recieved_message = "";
    if (radio.available())
    {
        update_oled("Recieved", "Message", "via NRF");
        radio.read(&recieved_message, sizeof(recieved_message));
    }
    else
        update_oled("Failed", "Message", "via NRF");
    delay(100);

    return recieved_message;
}

/**
 * @brief This function is used to fetch the latest data from each boxes on periodic instances.
 * This is activated when the Timer is activated and increases the count variable till its greater than the timer count.
 */
void regular_box_update(int counter)
{
    timerStop(timer);
    timerAlarmDisable(timer);
    Serial.println("");

    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Box", "Polling", "In Progress");
    delay(10000);

    rtc_get_time();
    connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
    for (int i = 0; i < connected_boxes; i++)
    {
        halt_rgb_ring(i);

        String str_delay_time = BOX_DETAILS[i][2];
        char char_delay_time[2];
        for (int i = 0; i < 2; i++)
        {
            char_delay_time[i] = str_delay_time[i];
        }
        int dt = atoi(char_delay_time);
        Serial.println("dt: " + (String)dt);
        if (counter % dt == 0)
        {
            String box_id = BOX_DETAILS[i][0];
            String address = BOX_DETAILS[i][1];
            update_oled("Contacting", "Box", box_id);
            update_box_data(box_id, address);
        }
    }

    solid_rgb_ring(GREEN_COLOR);
    update_oled("Box", "Polling", "Completed");
    timerStart(timer);
    timerAlarmEnable(timer);
}

/**
 * @brief Fetch Box Address from the Box ID Array matrix
 * 
 * @param box_id 9 byte Box ID
 * @return String 5 byte Box Communication Address
 */
String fetch_box_address(String box_id)
{
    int i;
    for (i = 0; i < connected_boxes; i++)
    {
        String box = BOX_DETAILS[i][0];
        if (box == box_id)
        {
            break;
        }
    }
    String address = BOX_DETAILS[i][1];
    return address;
}

//TODO: Auxillary Functions
/**
 * @brief Reading the SD Card File which stores the "Box ID and communication Address"
 */
void read_box_details_from_sd_card(void)
{
    Serial.println("Reading Box Details from SD Card");
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Read", "Box Details", "From SD");

    RL.readLines(BOX_ID_DETAILS_FILE, &handleEachLine);

    Serial.println("File Read Complete");
    solid_rgb_ring(GREEN_COLOR);
    update_oled("Box Details", "Read", "Done");
    return;
}

/**
 * @brief Read File Line by Line
 * 
 * @param line The Line to be read and saved
 * @param lineIndex The Index of the Line to be worked on
 */
void handleEachLine(char line[], int lineIndex)
{
    char box_id[BOX_ID_LENGTH];
    char address[COMMUNICATION_ID_LENGTH];
    char dt[2];

    for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + 2); i++)
    {
        if (i < BOX_ID_LENGTH)
        {
            box_id[i] = line[i];
        }
        else if (i < COMMUNICATION_ID_LENGTH)
        {
            address[i - BOX_ID_LENGTH] = line[i];
        }
        else
        {
            dt[i - BOX_ID_LENGTH - COMMUNICATION_ID_LENGTH] = line[i];
        }
    }

    BOX_DETAILS[lineIndex][0] = (String)box_id;
    BOX_DETAILS[lineIndex][1] = (String)address;
    BOX_DETAILS[lineIndex][2] = (String)dt;
    Serial.println("Box ID: " + BOX_DETAILS[lineIndex][0] + '\n' + "Box Address: " + BOX_DETAILS[lineIndex][1] + '\n' + "Delay Time: " + BOX_DETAILS[lineIndex][2]);
    return;
}

/**
 * @brief Read Error Log File Line by Line and save the latest error log on the variable
 * 
 * @param line 
 * @param lineIndex 
 */
void handleEachErrorLine(char line[], int lineIndex)
{
    char error_log[ERROR_LOG_LENGTH];

    for (int i = 0; i < ERROR_LOG_LENGTH; i++)
    {
        error_log[i] = line[i];
    }

    latest_error_log = (String)error_log;
    return;
}

/**
 * @brief Read Line by Line for SSID File
 * 
 * @param line 
 * @param lineIndex 
 */
void handleEachSSIDLine(char line[], int lineIndex)
{
    for (int i = 0; i < SSID_CHAR_LENGTH; i++)
    {
        ssid[i] = line[i];
        if (line[i] == NULL)
            return;
    }
}

/**
 * @brief Read Line by Line for Password File
 * 
 * @param line 
 * @param lineIndex 
 */
void handleEachPasswordLine(char line[], int lineIndex)
{
    for (int i = 0; i < PASSWORD_CHAR_LENGTH; i++)
    {
        password[i] = line[i];
        if (line[i] == NULL)
            return;
    }
}

//TODO: AWS Functions

/**
 * @brief This function is activated when the message is recieved from AWS
 * 
 * @param topic 
 * @param payload 
 */
void messageReceived(String &topic, String &payload)
{
    timerStop(timer);
    timerAlarmDisable(timer);
    //Reference (JSON to String Converter): https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonParserExample/JsonParserExample.ino
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Message", "Recieved", "from AWS");

    Serial.println("Recieved [" + topic + "]: " + payload);

    StaticJsonDocument<50> doc;
    DeserializationError error = deserializeJson(doc, payload);

    if (error)
    {
        Serial.print(F("deserializeJson() failed: "));
        Serial.println(error.f_str());
        return;
    }

    String box_id = doc["boxid"];
    String cmd = doc["cmd"];

