parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
    // Perform action as per the command from AWS
    if (cmd == "add") // Add new Box
    {
        String dt = doc["dt"];
        add_new_box(box_id, dt);
    }
    else if (cmd == "calibrate") //Calibrate box parameters
    {
        String address = fetch_box_address(box_id);
        calibrate_box(box_id, address);
    }
    else if (cmd == "ask") //Ask box for updated values
    {
        rtc_get_time();
        String address = fetch_box_address(box_id);
        solid_rgb_ring(YELLOW_COLOR);
        update_oled("Update", "Box", "In Progress");
        update_box_data(box_id, address);
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Update", "Box", "Successful");
    }
    else if (cmd == "change_setting") // Change box settings
    {
        String dt = doc["dt"];
        String st = doc["st"];
        String bt = doc["bt"];
        String address = fetch_box_address(box_id);
        change_box_setting(box_id, address, dt, st, bt);
    }
    else if (cmd == "buzz")
    {
        String address = fetch_box_address(box_id);
        sound_buzzer(box_id, address);
    }

    solid_rgb_ring(GREEN_COLOR);
    update_oled("AWS", "MSG Recieved", "Complete");
    timerStart(timer);
    timerAlarmEnable(timer);
}

void lwMQTTErr(lwmqtt_err_t reason)
{
    if (reason == lwmqtt_err_t::LWMQTT_SUCCESS)
        Serial.print("Success");
    else if (reason == lwmqtt_err_t::LWMQTT_BUFFER_TOO_SHORT)
        Serial.print("Buffer too short");
    else if (reason == lwmqtt_err_t::LWMQTT_VARNUM_OVERFLOW)
        Serial.print("Varnum overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_CONNECT)
        Serial.print("Network failed connect");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_TIMEOUT)
        Serial.print("Network timeout");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_READ)
        Serial.print("Network failed read");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_WRITE)
        Serial.print("Network failed write");
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_OVERFLOW)
        Serial.print("Remaining length overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_MISMATCH)
        Serial.print("Remaining length mismatch");
    else if (reason == lwmqtt_err_t::LWMQTT_MISSING_OR_WRONG_PACKET)
        Serial.print("Missing or wrong packet");
    else if (reason == lwmqtt_err_t::LWMQTT_CONNECTION_DENIED)
        Serial.print("Connection denied");
    else if (reason == lwmqtt_err_t::LWMQTT_FAILED_SUBSCRIPTION)
        Serial.print("Failed subscription");
    else if (reason == lwmqtt_err_t::LWMQTT_SUBACK_ARRAY_OVERFLOW)
        Serial.print("Suback array overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_PONG_TIMEOUT)
        Serial.print("Pong timeout");
}

void lwMQTTErrConnection(lwmqtt_return_code_t reason)
{
    if (reason == lwmqtt_return_code_t::LWMQTT_CONNECTION_ACCEPTED)
        Serial.print("Connection Accepted");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNACCEPTABLE_PROTOCOL)
        Serial.print("Unacceptable Protocol");
    else if (reason == lwmqtt_return_code_t::LWMQTT_IDENTIFIER_REJECTED)
        Serial.print("Identifier Rejected");
    else if (reason == lwmqtt_return_code_t::LWMQTT_SERVER_UNAVAILABLE)
        Serial.print("Server Unavailable");
    else if (reason == lwmqtt_return_code_t::LWMQTT_BAD_USERNAME_OR_PASSWORD)
        Serial.print("Bad UserName/Password");
    else if (reason == lwmqtt_return_code_t::LWMQTT_NOT_AUTHORIZED)
        Serial.print("Not Authorized");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNKNOWN_RETURN_CODE)
        Serial.print("Unknown Return Code");
}

void connectToMqtt(bool nonBlocking)
{
    Serial.print("MQTT connecting ");
    while (!client.connected())
    {
        if (client.connect(THINGNAME))
        {
            Serial.println("connected!");
            if (!client.subscribe(MQTT_SUB_TOPIC))
                lwMQTTErr(client.lastError());
        }
        else
        {
            Serial.print("SSL Error Code: ");
            //  Serial.println(net.getLastSSLError());
            Serial.print("failed, reason -> ");
            lwMQTTErrConnection(client.returnCode());
            if (!nonBlocking)
            {
                Serial.println(" < try again in 5 seconds");
                delay(5000);
            }
            else
            {
                Serial.println(" <");
            }
        }
        if (nonBlocking)
            break;
    }
}

void connectToWiFi(String init_str)
{
    if (init_str != emptyString)
        Serial.print(init_str);
    while (WiFi.status() != WL_CONNECTED)
    {
        Serial.print(".");
        delay(1000);
    }
    if (init_str != emptyString)
        Serial.println("ok!");
}

void checkWiFiThenMQTT(void)
{
    connectToWiFi("Checking WiFi");
    connectToMqtt(false);
}

unsigned long previousMillis = 0;
const long interval = 5000;

void checkWiFiThenMQTTNonBlocking(void)
{
    connectToWiFi(emptyString);
    if (millis() - previousMillis >= interval && !client.connected())
    {
        previousMillis = millis();
        connectToMqtt(true);
    }
}

void checkWiFiThenReboot(void)
{
    connectToWiFi("Checking WiFi");
    Serial.print("Rebooting");
    ESP.restart();
}

/**
 * @brief Upload data from special protocols to AWS
 * 
 * @param box_id 
 * @param command 
 * @param success_status 
 * @param param1 
 * @param param2 
 */
void send_Success_Data(String box_id, String command, int success_status, String param1, String param2, String param3)
{
    // Reference (String to JSON Converter):https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("AWS", "Upload", "InProgess");

    StaticJsonDocument<50> doc;
    doc["Box ID"] = box_id;
    doc["cmd"] = command;
    doc["success"] = success_status;

    if (command == "add")
        doc["Box Address"] = param1;
    else if (command == "calibration_update")
    {
        if (success_status == 1)
            doc["Calibration Data"] = param1;
    }
    else if (command = "change")
    {
        doc["dt"] = param1;
        doc["st"] = param2;
        doc["bt"] = param3;
    }
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }

    char shadow[measureJson(doc) + 1];

    serializeJson(doc, shadow, sizeof(shadow));

