parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", command, "Failure");
    }
    else
        update_oled("AWS", command, "Success");
}

/**
 * @brief Upload data to AWS for periodic box updates
 * 
 * @param box_id 
 * @param message 
 */
void sendData(String box_id, String message)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    char token = ',';
    char params[UPDATE_PARAMETERS][10] = {
        {/*Count*/},
        {/*Temperature*/},
        {/*Battery*/},
        {/*Offset*/},
        {/*Average Weight*/}};

    int j = 0;
    for (int i = 0; i < (sizeof(message) / message[0]); i++)
    {
        if (message[i] != token)
            params[j][i % 10] = message[i];
        else
            j++;
    }
    String c = (String)params[0]; //Count
    String t = (String)params[1]; //Temperature
    String b = (String)params[2]; //Battery
    String o = (String)params[3]; //Offset
    String a = (String)params[4]; //Average Weight

    StaticJsonDocument<50> doc;
    doc["time"] = (char)year + '/' + (char)month + '/' + (char)date + ' ' + (char)hour + ':' + (char)minutes + ':' + (char)seconds;
    doc["cmd"] = "ask";
    doc["c"] = c;
    doc["t"] = t;
    doc["b"] = b;
    doc["o"] = o;
    doc["a"] = a;
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));

    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", "update", "Failure");
    }
    else
        update_oled("AWS", "update", "Success");
}

//TODO: Basic Setup, Code Operation Starts here
void setup()
{
    Serial.begin(115200);
    rgb_ring_setup();
    oled_setup();
    sd_setup();
    radio.begin();
    EEPROM.begin(EEPROM_SIZE);
    pin_setup();
    wifi_ntp_setup();
    aws_setup();
    read_box_details_from_sd_card();
    RL.readLines(ERROR_LOG_FILE, &handleEachErrorLine);
    // if (BOX_DETAILS[0][0] == NULL)
    // {
    //     solid_rgb_ring(RED_COLOR);
    //     update_oled("No", "Box", "Linked");
    //     Serial.println("No Box Linked");
    //     while (BOX_DETAILS[0][0] == NULL)
    //     {
    //     }
    // }
    configure_timer();
    timerAlarmEnable(timer);
    print_company_logo();
    lastMillis = millis();
    EEPROM.write(CONNECTED_BOXES_STORED_LOCATION, 0);
    EEPROM.commit();
}

//TODO: Loop for the code
void loop()
{

    if (digitalRead(outputS) == HIGH) // Detects when the rotary encoder button is pressed
    {
        timerStop(timer);
        timerAlarmDisable(timer);
        delay(3 * DEBOUNCE_TIME); // Debounce time
        if (digitalRead(outputS) == HIGH)
        {
            delay(500);
            read_rotary_encoder(); // Open Main Menu
            print_company_logo();
        }
        delay(500);
        timerStart(timer);
        timerAlarmEnable(timer);
    }

    if ((count % DELAY_ONE_MINUTES) == 0) // When Count variable overflows the Timer Value, the periodic box polling is done
    {
        regular_box_update(count);
        if (count >= DELAY_SIXTY_MINUTES)
        {
            count = 0;
        }

        print_company_logo();
    }

    if ((millis() - lastMillis) > MAIN_SCREEN_REFRESH_TIME)
    {
        lastMillis = millis();

        if (main_screen_count >= MENU_SCREEN_LIST)
            main_screen_count = 1;
        else
            main_screen_count++;

        if (main_screen_count == 1) // Print Company Logo
            print_company_logo();

        else if (main_screen_count == 2) //Print Connected Boxes
        {
            connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
            update_oled("Connected", "Boxes:", (String)connected_boxes);
        }

        else if (main_screen_count == 3) // Print WiFi Status
        {
            String wifi_connection_status = "Disconnected";
            if (WiFi.status() == WL_CONNECTED)
                wifi_connection_status = "Connected";
            update_oled("WiFi", ssid, wifi_connection_status);
        }

        else if (main_screen_count == 4) // Print Date and Time
        {
            DateTime now = rtc.now();
            year = now.year();
            month = now.month();
            seconds = now.second();
            hour = now.hour();
            minutes = now.minute();
            seconds = now.second();

            String day = (String)year + '/' + (String)month + '/' + (String)date;
            String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
            Serial.println("Latest Time:\n" + day + ' ' + time);
            update_oled("Date Time", day, time);
        }

        else if (main_screen_count == 5) // Print Cloud Status
        {
            String mqtt_connection_status = "Disconnected";
            if (client.connected())
                mqtt_connection_status = "Connected";
            update_oled("MQTT", mqtt_connection_status, "");
        }

        else if (main_screen_count == 6) // Print Latest Error Log
            update_oled("Latest", "Error", latest_error_log);
    }
}
